src/Documents/ПодпискаНаСервис/ПодпискаНаСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодпискаНаСервис</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервнаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПодпискаНаСервис/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	КлиентОбъект = Клиент.ПолучитьОбъект();
	Если КлиентОбъект = Неопределено Или КлиентОбъект.Заблокирован() Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Клиент отсутствует или заблокирован.", "Клиент", ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	КлиентОбъект.Фамилия = Фамилия;
	КлиентОбъект.Имя = Имя;
	КлиентОбъект.Отчество = Отчество;
	КлиентОбъект.Пол = Пол;
	КлиентОбъект.ДопНомерТелефона = РезервныйТелефон;
	КлиентОбъект.ДопЭлектроннаяПочта = РезервнаяПочта;	
	КлиентОбъект.Адрес = Адрес;
	КлиентОбъект.Статус = Справочники.Статусы.Обычный;
	КлиентОбъект.НомерПаспорта = НомерПаспорта;
	КлиентОбъект.Серия = Серия;
	КлиентОбъект.КемВыдан = КемВыдан;
	КлиентОбъект.КогдаВыдан = ДатаВыдачи;
	КлиентОбъект.КодПодразделения = КодПодразделения;
	КлиентОбъект.ДатаРождения = ДатаРождения;
	КлиентОбъект.Записать();
КонецПроцедуры
